examples/rails_api/app/controllers/webhooks/mpesa_controller.rb

    def handle_event(event)
      verified = event.verify_signature(source_ip: request.remote_ip)

      WebhookEvent.create!(
        event_type: event.event_type,
        provider_reference: event.provider_reference,
        verified: verified,
        success: event.success?,
        payload: event.raw.to_json
      )
---
INSERT INTO "webhook_events" ("event_type", "provider_reference", "verified", "success", "payload", "created_at", "updated_at") VALUES ('stk_callback', 'ws_CO_1', FALSE, TRUE, '{"CheckoutRequestID":"ws_CO_1","ResultCode":0,"ResultDesc":"Success"}', '2026-08-29 14:37:52.672850', '2026-08-29 14:37:52.672850') RETURNING "id"