examples/rails_api/app/controllers/api/v1/refunds_controller.rb

      def create
        transaction = Transaction.create!(
          kind: "refund",
          status: "pending",
          amount_cents: params[:amount],
          currency: params.fetch(:currency, "KES"),
          account_reference: params[:transaction_id]
        )
---
INSERT INTO "transactions" ("kind", "status", "provider_reference", "amount_cents", "currency", "phone_number", "party_b", "account_reference", "raw_response", "error_message", "created_at", "updated_at") VALUES ('refund', 'pending', NULL, 100, 'KES', NULL, NULL, 'OEI2AK4Q16', NULL, NULL, '2026-08-29 14:37:52.760808', '2026-08-29 14:37:52.760808') RETURNING "id"