examples/rails_api/app/controllers/api/v1/stk_pushes_controller.rb

INSERT INTO "transactions" ("kind", "status", "provider_reference", "amount_cents", "currency", "phone_number", "party_b", "account_reference", "raw_response", "error_message", "created_at", "updated_at") VALUES ('stk_push', 'pending', NULL, 100, 'KES', '254712345678', NULL, 'ORDER-123', NULL, NULL, '2026-08-29 14:36:42.311425', '2026-08-29 14:36:42.311425') RETURNING "id"
UPDATE "transactions" SET "status" = 'failed', "error_message" = '{callback_url: ["must be an https:// URL"]}', "updated_at" = '2026-08-29 14:36:42.389710' WHERE "transactions"."id" = 1
UPDATE "transactions" SET "provider_reference" = 'ws_CO_290820261805416728833181', "raw_response" = '{"MerchantRequestID":"c520-4832-84bf-a8e41a82a93216457","CheckoutRequestID":"ws_CO_290820261805416728833181","ResponseCode":"0","ResponseDescription":"Success. Request accepted for processing","CustomerMessage":"Success. Request accepted for processing"}', "status" = 'accepted', "updated_at" = '2026-08-29 15:05:41.838638' WHERE "transactions"."id" = 6
---
      def create
        transaction = Transaction.create!(
          kind: "stk_push",
          status: "pending",
          amount_cents: params[:amount],
          currency: params.fetch(:currency, "KES"),
          phone_number: params[:phone_number],
          account_reference: params[:account_reference]
        )

        result = Lipwa.gateway(:mpesa).stk_push(
          amount: Lipwa::Money.new(amount: params[:amount].to_i, currency: params.fetch(:currency, "KES")),
          phone_number: params[:phone_number],
          account_reference: params[:account_reference],
          callback_url: stk_push_callback_url
        )

        render_result(
          result,
          status: :accepted,
          on_failure: ->(error) { transaction.update!(status: "failed", error_message: error.message) }
        ) do |response|
          transaction.update!(
            status: response.success? ? "accepted" : "rejected",
            provider_reference: response.provider_reference,
            raw_response: response.raw.to_json
          )